{
    "projects": [
        {
            "name": "GOV.UK",
            "ongoing": true,
            "abbr": "govuk",
            "job-role": "Frontend Developer",
            "summary": "Building new templates, enhancing accessibility, and working with other frontend developers to consolidate and improve the frontend architecture across the UK government website.",
            "description": "Primarily, my role as a frontend developer on GOV.UK involves building new templates and components, taking outcomes from user research and accessibility audits and turning them into actionable developer stories, enhancing the accessibility of GOV.UK and working with other frontend developers to consolidate and improve the frontend architecture across GOV.UK.<br /><br />In my time so far at GDS I have, among other things, built new topic pages to surface the sitewide taxonomy, converted hardcoded layouts into reusable, accessible, tested components, and led the frontend development of an EU Exit page for UK Citizens.",
            "url": "https://www.gov.uk",
            "clean_url": "gov.uk",
            "repo": "https://github.com/alphagov",
            "skills": "HTML, SASS, BEM, JavaScript, jQuery, Ruby on Rails, Mustache, Jasmine, RSpec, MiniTest",
            "images": [
                {
                    "name": "govuk.png",
                    "alt_text": "An image of www.gov.uk/prepare-eu-exit. This page was developed in the lead up to the EU Exit vote, to inform UK citizens of the content on GOV.UK related to EU Exit that may be of interest."
                },
                {
                    "name": "govuk1.png",
                    "alt_text": "An image of www.gov.uk/education, which surfaces content tagged to 'Education' in  the GOV.UK taxonomy."
                }
            ]
        },
        {
            "name": "Wedding Website",
            "ongoing": true,
            "abbr": "vawedding",
            "job-role": "Designer and Frontend Developer",
            "summary": "Design and build of a wedding website, primarily for guest RSVP.",
            "description": "Design and build of a wedding website, tying in with the colour scheme (navy, burgundy, neutrals and gold). The website will allow guests to view details of the wedding day; RSVP; choose food options; view the gift list; suggest music.",
            "skills": "HTML, SASS, BEM, JavaScript",
            "images": [
                {
                    "name": "vawedding.png",
                    "alt_text": "An image of the website landing page. The page contains an input field that asks for an RSVP code to login to the website."
                },
                {
                    "name": "vawedding1.png",
                    "alt_text": "An image of the website homepage (after logging in). It contains a picture of Vanita and Andy, information on the venue, and a menu bar to navigation to pages about food options, RSVP, music and gifts."
                }
            ]
        },
        {
            "name": "Siyan",
            "abbr": "siyan",
            "job-role": "Web Designer",
            "summary": "Website redesign for a leading design and lighting rental company.",
            "description": "Siyan's existing website wasn't doing a good job of showcasing what the company do and the events they are involved in. On top of that, the website performed poorly from an accessibility point-of-view, with extremely low colour contrast that in places made the text impossible to read. With a logo and colour scheme, I created a site that better reflects Siyan's branding. Site developed by <a href=\"https://andyms.uk\">Andy Smith</a>",
            "images": [
                {
                    "name": "siyan.png",
                    "alt_text": "Image of Siyan homepage, with cookie consent banner and live video header (with button to pause and play)."
                },
                {
                    "name": "siyan1.png",
                    "alt_text": "Image of Siyan 'What We Do' page, e.g: Concert Touring and Live Music; Rigging; Dry Hire."
                }
            ]
        },
        {
            "name": "List Management Application",
            "abbr": "books",
            "job-role": "Owner, Designer and Developer",
            "summary": "Design and build of a web application to track progress against various lists, in this case: <a href=\"https://www.listchallenges.com/1001-books-you-must-read-before-you-die\">1001 Books to Read Before You Die (2008 edition)</a>, UNESCO world heritage sites, and countries in the world.",
            "description": "The site uses a populated database of all 1001 books, UNESCO world heritage sites and countries, as well as providing the option for user-specified additions. A user can mark an item as 'Wishlist', 'Not Started', 'In Progress' or 'Completed'. The application has been built in an expandable way, using EJS components and generalised logic so adding a new list is relatively simple.",
            "skills": "HTML5, SCSS, JavaScript, MySQL, NodeJS, EJS, SVG (for interactive world map), ChartJS",
            "images": [
                {
                    "name": "books1.png",
                    "alt_text": "Image of travel landing page. Shows an interactive SVG map, where visited countries have been highlighted in orange and a user can mouse over a country and the country name is displayed as a label."
                },
                {
                    "name": "books2.png",
                    "alt_text": "Image of a books list page. Shows a table of books filtered to the author 'Virginia Woolf', and demonstrating that a user is able to click a table entry to edit it."
                }
            ]
        },
        {
            "name": "Denmark Street Big Band",
            "abbr": "bigband",
            "job-role": "Web Designer",
            "url": "https://denmarkstreetbigband.co.uk/",
            "clean_url": "denmarkstreetbigband.co.uk",
            "summary": "Re-design of an outdated Wordpress site for Denmark Street Big Band.",
            "description": "Denmark Street Big Band had been using the same Wordpress template which didn't fit their needs as it didn't let them highlight the most important information on the homepage. The workarounds which had to be used were cluttering up the page and making it very difficult to make sense of. This redesign puts information in priority order on the page, with a custom slideshow at the top so that band leader, Paul Burch, can specify what to feature at the top. There is also a renewed focus on the band's music, making their Youtube videos and Soundcloud recordings more prominent. Site developed by <a href=\"https://andyms.uk\">Andy Smith</a>.",
            "images": [
                {
                "name": "bigband.png",
                "alt_text": "An image of the Denmark Street Big Band homepage. The website has a bold black, red and white colour scheme. It highlights upcoming shows, latest news and videos."
                },
                {
                    "name": "bigband1.png",
                    "alt_text": "An image of the Denmark Steet Big Band video homepage. Shows a grid of video thumbnails."
                    }
            ]
        },
        {
            "name": "A secure cognitive behavioural therapy application",
            "abbr": "moodjar",
            "job-role": "Software Developer (Web and Android)",
            "summary": "Dissertation project exploring the use of secure technology to enhance communication between health professionals and patients within the health industry.",
            "description": "A secure android and web application, demonstrating how current technology could be used to increase and improve communications between patients and healthcare professionals, specifically in the area of mental health and cognitive behavioural therapy. Users would be signed up for an account by their healthcare professional and could use the android app to enter into their mood diary. This information was securely stored in an encrypted database and could be viewed only by that patient's doctor/therapist via the web admin interface.",
            "skills": "Java, Android Fingerprint Authentication API, HTML, SASS, jQuery, CanvasJS, nodeJS, PostgreSQL, Data Encryption (AES-GCM)",
            "images": [
                {
                "name": "moodjar.png",
                "alt_text": "Two images from the mobile application, side by side. The left shows the login page. The right shows a 'mood options menu' within the mood diary section, where users can select from six moods: happy; sad; neutral; angry; anxious; overwhelmed."
                }
            ]
        },
        {
            "name": "Castle Street Clinic",
            "abbr": "csc",
            "job-role": "Web Designer",
            "summary": "Website redesign for an osteopathy clinic.",
            "description": "Castle Street Clinic required a newly designed website to replace their outdated one, which users found difficult to navigate. The redesign splits the extensive information into more easily digestible chunks. The old site also featured a lot of pale yellow text, failing WCAG colour contrast requirements. The new design still makes strong use of the company branding, introducing the logo to the landing page, but fixes those accessibility issues.",
            "images": [
                {
                    "name": "csc.png",
                    "alt_text": "Image of the old Castle Street Clinic website. The majority of the text is a pale yellow or gold. Features a navigation sidebar to the left, with content on the right. There is no clear banding."
                },
                {
                    "name": "csc1.png",
                    "alt_text": "Image of the new Castle Street Clinic website. This new design now features the company logo and clear brand colours of yellow and blue. The navigation menu now runs horizontally across the top of the page. The page also now features call to action buttons to view treatments and therapists."
                }
            ]
        },
        {
            "name": "Sushi Lab",
            "abbr": "sushilab",
            "job-role": "Web Designer and Developer",
            "summary": "Website design for a new quick-service sushi restaurant based in Guildford.",
            "description": "Calvin required a website for the new sushi restaurant he was opening in Guildford town centre. He took a very laid-back approach, providing only the company logo and a request that the site be 'bold and exciting'. The site featured: animated SVG icons; custom CMS; social media and news feed, and custom styling of Google Maps. Developed alongside <a href=\"http://www.andrewmsmith.co.uk\" target=\"_blank\">Andy Smith</a>.",
            "skills": "HTML5, SCSS, SVG Animations, jQuery, RequireJS, Mustache, PHP, MySQL",
            "images":  [
                {
                    "name": "sushilab1.png",
                    "alt_text": "Sushi Lab homepage design."
                },
                {
                    "name": "sushilab2.png",
                    "alt_text": "Sushi Lab services page design."
                }
            ]
        }
    ]
}
